frontend/app/controllers/options_controller.rb

SELECT * FROM "options"
---
  def index
    @options = Option.all

SELECT * FROM "options" WHERE ("options"."id" = 1)
---
  def show
    @option = Option.find(params[:id])

SELECT * FROM "options" WHERE ("options"."id" = 1)
---
  def edit
    @option = Option.find(params[:id])

INSERT INTO "options" ("name", "price", "created_at", "image_url", "updated_at", "category_id", "article_id", "description") VALUES('Dotz Felge', NULL, '2010-12-03 11:53:23', 'http://www.mazda-forum.info/attachments/mazda3-und-mazda3-mps/3776d1232474117-dotz-hanzo-felgen-hanzo.jpg', '2010-12-03 11:53:23', 5, 'dotz_felge', 'Hochwertige Felgen aus irgendeinem Material')
---
  def create
    @option = Option.new(params[:option])

    respond_to do |format|
      if @option.save

SELECT * FROM "options" WHERE ("options"."id" = 1)
UPDATE "options" SET "updated_at" = '2010-12-02 17:17:16', "image_url" = 'http://www.weblogr.de/localola/wp-content/toyota-yaris-788037.jpg' WHERE "id" = 1
---
  def update
    @option = Option.find(params[:id])

    respond_to do |format|
      if @option.update_attributes(params[:option])

SELECT * FROM "options" WHERE ("options"."id" = 980190962)
DELETE FROM "options" WHERE "id" = 980190962
---
  def destroy
    @option = Option.find(params[:id])
    @option.destroy