frontend/app/controllers/workflow_controller.rb

  def index
    # redirect to finish if no more steps

    return redirect_to finish_url unless current_step

    available = RuleEngine.calculate chosen_options

    # fetch all categories for current step

    @category = Category.find_by_workflow_id current_step

    # skip step if category not found

    return skip_step unless @category

    # options matching available and category

    @options = @category.options.find_all_by_article_id available.collect(&:article_id), :order => :price

    # skip step and try again if no options available

    return skip_step if @options.blank?
---
SELECT * FROM "categories" WHERE ("categories"."workflow_id" IN ('modell')) LIMIT 1
SELECT * FROM "options" WHERE ("options"."article_id" IN ('aygo','three_doors','diesel','dotz_felge','aez_felge','msw_felge','gelb','schwarz','jvc_radio','jvc_radio2','becker_radio','medion_navigation','mio_navigation','standard_radio','keine_navigation')) AND ("options".category_id = 7) ORDER BY price
SELECT * FROM "options" WHERE ("options".category_id = 2)

  def choose_option
    available = RuleEngine.calculate chosen_options

    option = Option.find params[:id]
---
SELECT * FROM "options" WHERE ("options"."id" IN (3,5))

  def delete_option
    option = Option.find params[:id]
---
SELECT * FROM "options" WHERE ("options"."id" = 3)